package Practice_Group2;
//1. Создайте абстрактный класс Shape, в котором есть два абстрактных метода double getPerimetr() и double getArea().
//2. Создайте класс Point, в котором есть два свойства double x double y.
//3. Создайте классы, которые описывают, как минимум, три геометрические фигуры (они должны быть подклассами
//Shape). При этом они в качестве свойств должны содержать классы Point.
//4. Создайте класс доска. Доска поделена на 4 части в каждую часть доски можно положить одну из фигур. У доски должны
//быть методы которые помещают и удаляют фигуру с доски. Также должен быть метод который выводит информацию о
//всех фигурах лежащих на доске и их суммарную площадь.
public class Board {

}
